-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jun 11, 2017 at 11:38 PM
-- Server version: 10.1.21-MariaDB
-- PHP Version: 7.1.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `teamweb`
--

-- --------------------------------------------------------

--
-- Table structure for table `course`
--

CREATE TABLE `course` (
  `id` int(11) NOT NULL,
  `department` varchar(255) NOT NULL,
  `course_code` varchar(255) NOT NULL,
  `course_name` varchar(255) NOT NULL,
  `course_teacher` varchar(255) DEFAULT NULL,
  `course_time` varchar(255) NOT NULL,
  `course_compulsory` tinyint(1) NOT NULL,
  `course_credit` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `course`
--

INSERT INTO `course` (`id`, `department`, `course_code`, `course_name`, `course_teacher`, `course_time`, `course_compulsory`, `course_credit`) VALUES
(744, '資訊管理系', 'CC101A041', '英文字彙與閱讀(上)', '陳秋月', 'R1 R2', 1, 2),
(745, '資訊管理系', 'CC101A042', '英文字彙與閱讀(上)', '涂芷瑋', 'R1 R2', 1, 2),
(746, '資訊管理系', 'CC101A043', '英文字彙與閱讀(上)', '洪茂盛', 'R1 R2', 1, 2),
(747, '資訊管理系', 'CC101A051', '英文字彙與閱讀(上)', '涂芷瑋', 'R3 R4', 1, 2),
(748, '資訊管理系', 'CC101A052', '英文字彙與閱讀(上)', '洪茂盛', 'R3 R4', 1, 2),
(749, '資訊管理系', 'CC105A041', '英語口語訓練(上)', 'Aaron', 'R1 R2', 1, 2),
(750, '資訊管理系', 'CC105A042', '英語口語訓練(上)', 'Nicholas', 'R1 R2', 1, 2),
(751, '資訊管理系', 'CC105A051', '英語口語訓練(上)', 'Aaron', 'R3 R4', 1, 2),
(752, '資訊管理系', 'CC105A052', '英語口語訓練(上)', 'Nicholas', 'R3 R4', 1, 2),
(753, '資訊管理系', 'CC105A053', '英語口語訓練(上)', '蔡玫馨', 'R3 R4', 1, 2),
(754, '資訊管理系', 'CC1245301', '表達與文學閱讀（一）', '游適宏', 'T2 T3 T4', 1, 3),
(755, '資訊管理系', 'CC1245302', '表達與文學閱讀（一）', '陳碧月', 'T2 T3 T4', 1, 3),
(756, '資訊管理系', 'CC1245303', '表達與文學閱讀（一）', '周雅清', 'T2 T3 T4', 1, 3),
(757, '資訊管理系', 'CC1245304', '表達與文學閱讀（一）', '楊佳蓉', 'T2 T3 T4', 1, 3),
(758, '資訊管理系', 'CC1246301', '表達與經典閱讀（一）', '王慧燕', 'T2 T3 T4', 1, 3),
(759, '資訊管理系', 'CC1247301', '創意與文學閱讀（一）', '蔡明蓉', 'T2 T3 T4', 1, 3),
(760, '資訊管理系', 'CC3202301', '英文閱讀與討論', '李奎皓', 'RA RB', 1, 2),
(761, '資訊管理系', 'MB2100301', '管理與企業倫理', '李國光', 'R7 R8 R9', 1, 3),
(762, '資訊管理系', 'MB2100302', '管理與企業倫理', '林義貴', 'R7 R8 R9', 1, 3),
(763, '資訊管理系', 'MB2100303', '管理與企業倫理', '羅凱揚', 'R7 R8 R9', 1, 3),
(764, '資訊管理系', 'MI1002301', '經濟學', '朱宇倩', 'W2 W3 W4', 1, 3),
(765, '資訊管理系', 'MI1006301', '計算機概論', '吳柏翰', 'F2 F3 F4', 1, 3),
(766, '資訊管理系', 'MI1006302', '計算機概論', '吳柏翰', 'M2 M3 M4', 1, 3),
(767, '資訊管理系', 'MI161A001', '微積分(上)', '洪皖中', 'T6 T7 T8 T9', 1, 3),
(768, '資訊管理系', 'MI2202701', '應用程式語言', '陳文川', 'M2 M3 M4', 0, 3),
(769, '資訊管理系', 'MI3002301', '資料結構', '林伯慎', 'W6 F3 F4', 1, 3),
(770, '資訊管理系', 'MI3008301', '管理數學', '洪政煌', 'T6 T7 R3', 1, 3),
(771, '資訊管理系', 'MI3013701', '資訊安全導論', '吳宗成', 'T2 T3 T4', 0, 3),
(772, '資訊管理系', 'MI306A001', '統計學(上)', '楊維寧', 'T1 F1 F2', 1, 3),
(773, '資訊管理系', 'MI306A002', '統計學(上)', '楊維寧', 'W1 F6 F7', 1, 3),
(774, '資訊管理系', 'MI306A003', '統計學(上)', '楊維寧', 'W1 F6 F7', 1, 3),
(775, '資訊管理系', 'MI3509701', '資訊系統安全與管理', '蔡佳倫', 'W7 W8 W9', 0, 3),
(776, '資訊管理系', 'MI3510701', '雲端運算應用與實務', '陳麗如', 'R6 R7 R8', 0, 3),
(777, '資訊管理系', 'MI4002301', '資料庫管理系統', '查士朝', 'W7 F8 F9', 1, 3),
(778, '資訊管理系', 'MI4003701', '軟體工程', '黃世禎', 'F2 F3 F4', 0, 3),
(779, '資訊管理系', 'MI4111701', '資訊管理校外實習', '', 'M1 M2 M3 M4 M5 M6 M7 M8 M9 T1 T2 T3 T4 T5 T6 T7 T8 T9 W1 W2 W3 W4 W5 W6 W7 W8 W9 R1 R2 R3R4 R5 R6 R7 R8 R9 F1 F2 F3 F4 F5 F6 F7 F8 F9', 0, 9),
(780, '資訊管理系', 'MI4113701', '資料庫交易處理理論與實務', '呂永和', 'W2 W3 W4', 0, 3),
(781, '資訊管理系', 'MI4116701', '資訊管理校外實習(三)', '', '', 0, 3),
(782, '資訊管理系', 'MI414A001', '資管專業校外實習(上)', '', '', 1, 2),
(783, '資訊管理系', 'MI4202701', '離散數學', '楊傳凱', 'M2 F6 F7', 0, 3),
(784, '資訊管理系', 'MI4206301', '資訊網路', '賴源正', 'M9 T7 T8', 1, 3),
(785, '資訊管理系', 'MI4214701', '進階物件導向程式設計', '林伯慎', 'R2 R3 R4', 0, 3),
(786, '資訊管理系', 'MI4310701', '電子商務安全', '吳宗成', 'M6 M7 M8', 0, 3),
(787, '資訊管理系', 'MI4982701', '資訊管理專業成長校外實習(二)', '', '', 0, 1),
(788, '資訊管理系', 'MI4983701', '資訊管理專業成長校外實習(三)', '', '', 0, 1),
(789, '資訊管理系', 'MI4991701', '資訊管理專業成長校外實習', '', '必', 0, 1),
(790, '資訊管理系', 'MI4992701', '資訊管理專業成長校外實習', '', '', 0, 2),
(791, '資訊管理系', 'MI4993701', '資訊管理專業成長校外實習', '', '', 0, 3),
(792, '資訊管理系', 'MI499A001', '實務專題(上)', '', '', 1, 2),
(793, '資訊管理系', 'MI5014701', '科技研究與論文寫作', '賴源正', 'M6 M7 M8', 0, 3),
(794, '資訊管理系', 'MI5109701', '高等演算法', '徐俊傑', 'M2 M3 M4', 0, 3),
(795, '資訊管理系', 'MI5117701', '網路服務資訊安全', '羅乃維', 'T6 T7 T8', 0, 3),
(796, '資訊管理系', 'MI5217701', '數量方法─統計方法與資料分析', '楊維寧', 'R1 R2 R3', 0, 3),
(797, '資訊管理系', 'MI5224701', '創新與企業家精神', '多位教師{盧希鵬、羅台生}', 'W2 W3 W4', 0, 3),
(798, '資訊管理系', 'MI5225701', '創業管理理論與實務', '金志聿', 'T7 T8 T9', 0, 3),
(799, '資訊管理系', 'MI5226701', '智能營運', '多位教師{吳宗成、廖燿堂}', 'W6 W7 W8', 0, 3),
(800, '資訊管理系', 'MI5229701', '資訊科技與組織行為理論', '盧希鵬', 'T2 T3 T4', 0, 3),
(801, '資訊管理系', 'MI5300701', '多媒體系統', '楊傳凱', 'T2 T3 T4', 0, 3),
(802, '資訊管理系', 'MI5303701', '資訊科技管理', '周子銓', 'R2 R3 R4', 0, 3),
(803, '資訊管理系', 'MI5309701', '資訊系統與管理', '朱宇倩', 'T6 T7 T8', 0, 3),
(804, '資訊管理系', 'MI5410701', '策略知識管理', '李國光', 'W6 W7 W8', 0, 3),
(805, '資訊管理系', 'MI5413701', '網路流量模式與應用', '洪政煌', 'W6 W7 W8', 0, 3),
(806, '資訊管理系', 'MI5510701', '科技與法律', '陳曉慧', 'T2 T3 T4', 0, 3),
(807, '資訊管理系', 'MI5512701', '科技與創新管理', '陳正綱', 'W2 W3 W4', 0, 3),
(808, '資訊管理系', 'MI5601701', '電子商務', '徐慧霞', 'M6 M7 M8', 0, 3),
(809, '資訊管理系', 'MI5908301', '資訊管理專題研討', '楊傳凱', 'R8 R9', 1, 0),
(810, '資訊管理系', 'MI5909301', '資訊管理專題研討(二)', '楊傳凱', 'R8 R9', 1, 0),
(811, '資訊管理系', 'MI5910701', '資訊安全與計量運算專題研究(一)', '多位教師{吳宗成、查士朝、洪政煌、陳正綱、楊維寧}', 'R5 R6 R7', 0, 3),
(812, '資訊管理系', 'MI5912701', '無線網路專題研究(一)', '羅乃維', 'R5 R6 R7', 0, 3),
(813, '資訊管理系', 'MI5913701', '多媒體專題研究(一)', '多位教師{呂永和、林伯慎、楊傳凱}', 'R5 R6 R7', 0, 3),
(814, '資訊管理系', 'MI5917701', '演算法專題研究(二)', '徐俊傑', 'R5 R6 R7', 0, 3),
(815, '資訊管理系', 'MI5982701', '資訊管理進階專業成長校外實習(二)', '', '', 0, 1),
(816, '資訊管理系', 'MI5983701', '資訊管理進階專業成長校外實習(三)', '', '', 0, 1),
(817, '資訊管理系', 'MI5991701', '資訊管理進階專業成長校外實習', '', '', 0, 1),
(818, '資訊管理系', 'MI5992701', '資訊管理進階專業成長校外實習', '', '', 0, 2),
(819, '資訊管理系', 'MI5993701', '資訊管理進階專業成長校外實習', '', '', 0, 3),
(820, '資訊管理系', 'MI9001701', '科技與創新管理', '陳正綱', 'MA MB MC', 0, 3),
(821, '資訊管理系', 'MI9003701', '電子商務', '欒 斌', 'RA RB RC', 0, 3),
(822, '資訊管理系', 'MI9005701', '軟體工程與管理', '黃世禎', 'TA TB TC', 0, 3),
(823, '資訊管理系', 'MI9005702', '軟體工程與管理', '黃世禎', 'W7 W8 W9', 0, 3),
(824, '資訊管理系', 'MI9016701', '資安科技與管理', '查士朝', 'S2 S3 S4', 0, 3),
(825, '資訊管理系', 'MI9026701', '資料探勘', '呂永和', 'M2 M3 M4', 0, 3),
(826, '資訊管理系', 'MI9027701', '智能營運', '翁樸棟', 'WA WB WC', 0, 3),
(827, '資訊管理系', 'TC1011701', '職業倫理', '多位教師{陳亞男、游紫華}', 'T2', 0, 1),
(828, '資訊管理系', 'TC2001701', '全民國防教育軍事訓練－全民國防', '胡金妮', 'M8 M9', 0, 0),
(829, '資訊管理系', 'TC2002701', '全民國防教育軍事訓練－防衛動員', '張敏郎', 'T8 T9', 0, 0),
(830, '資訊管理系', 'TC2003701', '全民國防教育軍事訓練－國防政策', '陳世平', 'R8 R9', 0, 0),
(831, '資訊管理系', 'TC2004701', '全民國防教育軍事訓練－國防科技', '謝宏偉', 'W8 W9', 0, 0),
(832, '企業管理系', 'BA130A001', '經濟學(上)', '劉邦典', 'T6 T7 T8', 1, 3),
(833, '企業管理系', 'BA139A501', '會計學(上)', '鄧美玉', 'TA TB TC', 0, 3),
(834, '企業管理系', 'BA141A001', '商業電腦應用(上)', '詹雅晴', 'F2 F3 F4', 1, 3),
(835, '企業管理系', 'BA141A002', '商業電腦應用(上)', '詹雅晴', 'M2 M3 M4', 1, 3),
(836, '企業管理系', 'BA161A001', '微積分(上)', '邱華敏', 'W6 W7 W8 F5', 1, 3),
(837, '企業管理系', 'BA179A501', '會計學實習(上)', '鄧美玉', 'W10 WA', 0, 1),
(838, '企業管理系', 'BA1803701', '企業管理實務', '吳克振', 'M2 M3 M4', 0, 3),
(839, '企業管理系', 'BA2101301', '初級英文寫作(一)', '徐碧霞', 'F6 F7', 1, 2),
(840, '企業管理系', 'BA2101302', '初級英文寫作(一)', '張玉英', 'F6 F7', 1, 2),
(841, '企業管理系', 'BA2201301', '行銷管理', '盛麗慧', 'M6 M7 M8', 1, 3),
(842, '企業管理系', 'BA2201302', '行銷管理', '葉明義', 'T8 T9 T10', 1, 3),
(843, '企業管理系', 'BA2208301', '成本會計', '郭啟賢', 'R8 R9 R10', 1, 3),
(844, '企業管理系', 'BA2208302', '成本會計', '王詩鳳', 'F2 F3 F4', 1, 3),
(845, '企業管理系', 'BA2215701', '管理心理學基礎科學實驗', '謝亦泰', 'T6 T7 T8', 0, 3),
(846, '企業管理系', 'BA2300301', '管理會計', '張鳳真', 'T6 T7 T8', 1, 3),
(847, '企業管理系', 'BA2304701', '企業概論', '許奉文', 'W2 W3 W4', 0, 3),
(848, '企業管理系', 'BA2505301', '管理數學', '王聖淵', 'M8 M9 M10', 1, 3),
(849, '企業管理系', 'BA2911701', '談判學', '許重博', 'RA RB RC', 0, 3),
(850, '企業管理系', 'BA3010301', '商用英文', '張玉英', 'F2 F3 F4', 1, 3),
(851, '企業管理系', 'BA3010302', '商用英文', '徐碧霞', 'F2 F3 F4', 1, 3),
(852, '企業管理系', 'BA3010303', '商用英文', '王承怡', 'F2 F3 F4', 1, 3),
(853, '企業管理系', 'BA305A001', '統計學(上)', '張琬喻', 'W6 W7 W8', 1, 3),
(854, '企業管理系', 'BA305A002', '統計學(上)', '未 定', 'W6 W7 W8', 1, 3),
(855, '企業管理系', 'BA3100701', '組織行為', '葉穎蓉', 'R2 R3 R4', 0, 3),
(856, '企業管理系', 'BA3110701', '組織變革管理', '鄭仁偉', 'W6 W7 W8', 0, 3),
(857, '企業管理系', 'BA3208302', '財務管理', '潘明如', 'R6 R7 R8', 1, 3),
(858, '企業管理系', 'BA3209303', '人力資源管理', '葉穎蓉', 'T6 T7 T8', 1, 3),
(859, '企業管理系', 'BA3313701', '財務報表分析', '林建成', 'F2 F3 F4', 0, 3),
(860, '企業管理系', 'BA3606301', '生產與作業管理', '呂志豪', 'W2 W3 W4', 1, 3),
(861, '企業管理系', 'BA4003301', '英語演講(一)', '王承怡', 'F8 F9', 1, 2),
(862, '企業管理系', 'BA4003302', '英語演講(一)', '徐碧霞', 'F8 F9', 1, 2),
(863, '企業管理系', 'BA4003303', '英語演講(一)', '王承怡', 'F6 F7', 1, 2),
(864, '企業管理系', 'BA4004301', '英語演講(二)', '王承怡', 'T9 T10', 1, 2),
(865, '企業管理系', 'BA4101701', '服務業行銷', '呂文琴', 'R6 R7 R8', 0, 3),
(866, '企業管理系', 'BA4104701', '電影與管理', '陳崇文', 'T6 T7 T8', 0, 3),
(867, '企業管理系', 'BA4303701', '創意思考與社會企業實作', '王蕙芝', 'T2 T3 T4', 0, 3),
(868, '企業管理系', 'BA4400301', '企業政策', '劉邦典', 'M6 M7 M8', 1, 3),
(869, '企業管理系', 'BA4400302', '企業政策', '曾盛恕', 'W2 W3 W4', 1, 3),
(870, '企業管理系', 'BA4406701', '證券管理', '王耀華', 'WA WB', 0, 2),
(871, '企業管理系', 'BA4408701', '商事法', '陳進會', 'R8 R9 R10', 0, 3),
(872, '企業管理系', 'BA4704701', '國際金融', '王健全', 'MA MB MC', 0, 3),
(873, '企業管理系', 'BA4903701', '電子商業', '欒 斌', 'W5 W6 W7', 0, 3),
(874, '企業管理系', 'BA499B001', '實務專題(下)', '', '', 1, 2),
(875, '企業管理系', 'BA5302701', '管理會計', '郭啟賢', 'F6 F7 F8', 0, 3),
(876, '企業管理系', 'BA5400701', '財報分析', '郭啟賢', 'S6 S7 S8', 0, 3),
(877, '企業管理系', 'BA5436701', '創新與價值創造', '吳克振', 'W6 W7 W8', 0, 3),
(878, '企業管理系', 'BA5436702', '創新與價值創造', '吳克振', 'TA TB TC', 0, 3),
(879, '企業管理系', 'BA5501701', '策略管理', '曾盛恕', 'TA TB TC', 0, 3),
(880, '企業管理系', 'BA5606701', '行動商業應用開發入門', '林俊志', 'T2 T3 T4', 0, 3),
(881, '企業管理系', 'BA5901301', '專題研討(一)', '多位教師{盛麗慧、陳崇文}', 'R8 R9', 1, 0),
(882, '企業管理系', 'BA5901302', '專題研討(一)', '王蕙芝', 'R8 R9', 1, 0),
(883, '企業管理系', 'BA6002701', '企業質性研究方法', '張譯尹', 'T2 T3 T4', 0, 3),
(884, '企業管理系', 'BA6007701', '組織心理學專題(一)', '邱淑芬', 'F6 F7 F8', 0, 3),
(885, '企業管理系', 'BA6011701', '組織創新與創業專題研討', '張譯尹', 'W2 W3 W4', 0, 3),
(886, '企業管理系', 'BA6014701', '創新思維與市場實作', '王蕙芝', 'T6 T7 T8', 0, 3),
(887, '企業管理系', 'BA6205701', '消費者行為', '葉明義', 'R2 R3 R4', 0, 3),
(888, '企業管理系', 'BA6231701', '智慧財產權與行銷策略', '陳曉慧', 'W2 W3 W4', 0, 3),
(889, '企業管理系', 'BA6603701', '人力資源甄選', '呂志豪', 'M6 M7 M8', 0, 3),
(890, '企業管理系', 'BA6605701', '人力資源管理', '張譯尹', 'R2 R3 R4', 0, 3),
(891, '企業管理系', 'BA6613701', '結構方程式模型之理論與應用', '沈其泰', 'F2 F3 F4', 0, 3),
(892, '企業管理系', 'BA6620701', '跨文化管理', '陳崇文', 'W6 W7 W8', 0, 3),
(893, '企業管理系', 'BA6700701', '產業經濟研討(一)', '劉邦典', 'W6 W7 W8', 0, 3),
(894, '企業管理系', 'BA6905701', '判斷與決策研討', '葉明義', 'T2 T3 T4', 0, 3),
(895, '企業管理系', 'BA6906701', '高科技產業與策略分析', '張順教', 'F8 F9 F10', 0, 3),
(896, '企業管理系', 'BA7103701', '策略理論', '曾盛恕', 'T6 T7 T8', 0, 3),
(897, '企業管理系', 'BA7110701', '組織行為專題（一）', '多位教師{葉穎蓉、鄭仁偉、謝亦泰}', 'WA WB WC', 0, 3),
(898, '企業管理系', 'BA7120701', '組織管理研究法專題(一)', '謝亦泰', 'F6 F7 F8', 0, 3),
(899, '企業管理系', 'BA7601701', '企業研究方法論', '邱淑芬', 'T6 T7 T8', 0, 3),
(900, '企業管理系', 'BA7707701', '計量經濟(一)', '張順教', 'M8 M9 M10', 0, 3),
(901, '企業管理系', 'BA7805701', '組織理論', '鄭仁偉', 'R2 R3 R4', 0, 3),
(902, '企業管理系', 'BA7808701', '專案管理', '傅旭昇', 'M6 M7 M8', 0, 3),
(903, '企業管理系', 'CC101A041', '英文字彙與閱讀(上)', '陳秋月', 'R1 R2', 1, 2),
(904, '企業管理系', 'CC101A042', '英文字彙與閱讀(上)', '涂芷瑋', 'R1 R2', 1, 2),
(905, '企業管理系', 'CC101A043', '英文字彙與閱讀(上)', '洪茂盛', 'R1 R2', 1, 2),
(906, '企業管理系', 'CC101A051', '英文字彙與閱讀(上)', '涂芷瑋', 'R3 R4', 1, 2),
(907, '企業管理系', 'CC101A052', '英文字彙與閱讀(上)', '洪茂盛', 'R3 R4', 1, 2),
(908, '企業管理系', 'CC105A041', '英語口語訓練(上)', 'Aaron', 'R1 R2', 1, 2),
(909, '企業管理系', 'CC105A042', '英語口語訓練(上)', 'Nicholas', 'R1 R2', 1, 2),
(910, '企業管理系', 'CC105A051', '英語口語訓練(上)', 'Aaron', 'R3 R4', 1, 2),
(911, '企業管理系', 'CC105A052', '英語口語訓練(上)', 'Nicholas', 'R3 R4', 1, 2),
(912, '企業管理系', 'CC105A053', '英語口語訓練(上)', '蔡玫馨', 'R3 R4', 1, 2),
(913, '企業管理系', 'CC1245308', '表達與文學閱讀（一）', '周雅清', 'F6 F7 F8', 1, 3),
(914, '企業管理系', 'CC1246304', '表達與經典閱讀（一）', '王慧燕', 'F6 F7 F8', 1, 3),
(915, '企業管理系', 'CC1248302', '創意與經典閱讀（一）', '張瀛太', 'F6 F7 F8', 1, 3),
(916, '企業管理系', 'CC3202301', '英文閱讀與討論', '李奎皓', 'RA RB', 1, 2),
(917, '企業管理系', 'FN5106701', '總體經濟政策', '劉代洋', 'MA MB MC', 0, 3),
(918, '企業管理系', 'FN5108701', '策略管理', '劉代洋', 'W2 W3 W4', 0, 3),
(919, '企業管理系', 'FN5303701', '計量經濟', '繆維中', 'M7 M8 M9', 0, 3),
(920, '企業管理系', 'FN5401701', '財務管理', '張光第', 'W6 W7 W8', 0, 3),
(921, '企業管理系', 'FN5402701', '行為財務學', '張琬喻', 'M2 M3 M4', 0, 3),
(922, '企業管理系', 'FN5502701', '交易系統與技術分析實證', '陳俊男', 'T2 T3 T4', 0, 3),
(923, '企業管理系', 'FN5505701', '商業模式與財務金融策略管理', '陳俊男', 'WA WB WC', 0, 3),
(924, '企業管理系', 'FN5601701', '國際財務管理', '謝劍平', 'T6 T7 T8', 0, 3),
(925, '企業管理系', 'FN5741701', '期貨與選擇權', '陳俊男', 'R2 R3 R4', 0, 3),
(926, '企業管理系', 'FN5741702', '期貨與選擇權', '繆維中', 'S6 S7 S8', 0, 3),
(927, '企業管理系', 'FN6752701', '資產證券化', '張光第', 'FA FB FC', 0, 3),
(928, '企業管理系', 'MB2100301', '管理與企業倫理', '李國光', 'R7 R8 R9', 1, 3),
(929, '企業管理系', 'MB2100302', '管理與企業倫理', '林義貴', 'R7 R8 R9', 1, 3),
(930, '企業管理系', 'MB2100303', '管理與企業倫理', '羅凱揚', 'R7 R8 R9', 1, 3),
(931, '企業管理系', 'TC1011701', '職業倫理', '多位教師{陳亞男、游紫華}', 'T2', 0, 1),
(932, '企業管理系', 'TC2001701', '全民國防教育軍事訓練－全民國防', '胡金妮', 'M8 M9', 0, 0),
(933, '企業管理系', 'TC2002701', '全民國防教育軍事訓練－防衛動員', '張敏郎', 'T8 T9', 0, 0),
(934, '企業管理系', 'TC2003701', '全民國防教育軍事訓練－國防政策', '陳世平', 'R8 R9', 0, 0),
(935, '企業管理系', 'TC2004701', '全民國防教育軍事訓練－國防科技', '謝宏偉', 'W8 W9', 0, 0),
(936, '工業管理系', 'CC101A041', '英文字彙與閱讀(上)', '陳秋月', 'R1 R2', 1, 2),
(937, '工業管理系', 'CC101A042', '英文字彙與閱讀(上)', '涂芷瑋', 'R1 R2', 1, 2),
(938, '工業管理系', 'CC101A043', '英文字彙與閱讀(上)', '洪茂盛', 'R1 R2', 1, 2),
(939, '工業管理系', 'CC101A051', '英文字彙與閱讀(上)', '涂芷瑋', 'R3 R4', 1, 2),
(940, '工業管理系', 'CC101A052', '英文字彙與閱讀(上)', '洪茂盛', 'R3 R4', 1, 2),
(941, '工業管理系', 'CC105A041', '英語口語訓練(上)', 'Aaron', 'R1 R2', 1, 2),
(942, '工業管理系', 'CC105A042', '英語口語訓練(上)', 'Nicholas', 'R1 R2', 1, 2),
(943, '工業管理系', 'CC105A051', '英語口語訓練(上)', 'Aaron', 'R3 R4', 1, 2),
(944, '工業管理系', 'CC105A052', '英語口語訓練(上)', 'Nicholas', 'R3 R4', 1, 2),
(945, '工業管理系', 'CC105A053', '英語口語訓練(上)', '蔡玫馨', 'R3 R4', 1, 2),
(946, '工業管理系', 'CC1245308', '表達與文學閱讀（一）', '周雅清', 'F6 F7 F8', 1, 3),
(947, '工業管理系', 'CC1246304', '表達與經典閱讀（一）', '王慧燕', 'F6 F7 F8', 1, 3),
(948, '工業管理系', 'CC1248302', '創意與經典閱讀（一）', '張瀛太', 'F6 F7 F8', 1, 3),
(949, '工業管理系', 'CC3202301', '英文閱讀與討論', '李奎皓', 'RA RB', 1, 2),
(950, '工業管理系', 'IM160A001', '微積分(上)', '蔡欣男', 'M6 M7 M8 F3', 1, 3),
(951, '工業管理系', 'IM3003301', '統計學(一)', '林希偉', 'T2 T3 T4', 1, 3),
(952, '工業管理系', 'IM3003302', '統計學(一)', '葉瑞徽', 'T2 T3 T4', 1, 3),
(953, '工業管理系', 'IM3005301', '管理數學', '李強笙', 'W2 W3 W4', 1, 3),
(954, '工業管理系', 'IM3005302', '管理數學', '楊朝龍', 'W2 W3 W4', 1, 3),
(955, '工業管理系', 'IM3010701', '服務科學', '王孔政', 'W2 W3 W4', 0, 3),
(956, '工業管理系', 'IM3301301', '經濟學', '黃庭鍾', 'T8 T9 T10', 1, 3),
(957, '工業管理系', 'IM3509301', '計算機概論', '古鴻炎', 'T3 T4', 1, 2),
(958, '工業管理系', 'IM3509302', '計算機概論', '周世忠', 'F1 F2', 1, 2),
(959, '工業管理系', 'IM3809301', '計算機概論實習', '古鴻炎', 'M1 M2', 1, 1),
(960, '工業管理系', 'IM3809302', '計算機概論實習', '周世忠', 'M3 M4', 1, 1),
(961, '工業管理系', 'IM4103301', '作業研究(一)', '喻奉天', 'R2 R3 R4', 1, 3),
(962, '工業管理系', 'IM4103302', '作業研究(一)', '郭伯勳', 'R2 R3 R4', 1, 3),
(963, '工業管理系', 'IM4403301', '工作研究', '紀佳芬', 'M8 M9', 1, 2),
(964, '工業管理系', 'IM4403302', '工作研究', '林承哲', 'F6 F7', 1, 2),
(965, '工業管理系', 'IM4415701', '智慧營運管理', '李永輝', 'M6 M7 M8', 0, 3),
(966, '工業管理系', 'IM4513701', '物件導向程式設計', '金台齡', 'M2 W3 W4', 0, 3),
(967, '工業管理系', 'IM4612701', '工業衛生', '謝宗霖', 'M10 MA MB', 0, 3),
(968, '工業管理系', 'IM4620301', '電子化企業概論', '歐陽超', 'F3 F4', 1, 2),
(969, '工業管理系', 'IM4620302', '電子化企業概論', '楊朝龍', 'T6 T7', 1, 2),
(970, '工業管理系', 'IM4624301', '電子化企業概論實習', '歐陽超', 'T6 T7', 1, 1),
(971, '工業管理系', 'IM4624302', '電子化企業概論實習', '楊朝龍', 'F3 F4', 1, 1),
(972, '工業管理系', 'IM4703301', '工作研究實習', '紀佳芬', 'F6 F7', 1, 1),
(973, '工業管理系', 'IM4703302', '工作研究實習', '林承哲', 'M8 M9', 1, 1),
(974, '工業管理系', 'IM4704301', '品質管理', '葉瑞徽', 'W6 W7 W8', 1, 3),
(975, '工業管理系', 'IM4704302', '品質管理', '王福琨', 'W6 W7 W8', 1, 3),
(976, '工業管理系', 'IM4706701', '全面品質管理', '朱燦然', 'T2 T3 T4', 0, 3),
(977, '工業管理系', 'IM499B001', '實務專題(下)', '', '', 1, 2),
(978, '工業管理系', 'IM5508701', '決策分析', '林希偉', 'W2 W3 W4', 0, 3),
(979, '工業管理系', 'IM5711701', '服務管理', '郭人介', 'M6 M7 M8', 0, 3),
(980, '工業管理系', 'IM5713701', '人為決策模式與應用', '林樹強', 'T2 T3 T4', 0, 3),
(981, '工業管理系', 'IM5802701', '供應鏈管理', '周碩彥', 'M6 M7 M8', 0, 3),
(982, '工業管理系', 'IM5803701', '資料探勘應用', '郭人介', 'R2 R3 R4', 0, 3),
(983, '工業管理系', 'IM5804701', '商業物流與供應鏈最佳化', '喻奉天', 'W6 W7 W8', 0, 3),
(984, '工業管理系', 'IM5906701', '科技與法律', '陳曉慧', 'T2 T3 T4', 0, 3),
(985, '工業管理系', 'IM6104701', '迴歸分析', '李強笙', 'T2 T3 T4', 0, 3),
(986, '工業管理系', 'IM6200701', '全面品質管理', '羅士哲', 'W6 W7 W8', 0, 3),
(987, '工業管理系', 'IM6206301', '工業管理書報研討(一)', '多位教師{林希偉、曹譽鐘}', 'R8 R9', 1, 0),
(988, '工業管理系', 'IM6206302', '工業管理書報研討(一)', '多位教師{周碩彥、羅士哲}', 'R8 R9', 1, 0),
(989, '工業管理系', 'IM6210701', '企業模型構建與分析', '歐陽超', 'W2 W3 W4', 0, 3),
(990, '工業管理系', 'IM6307701', '生產管理系統', '王孔政', 'T2 T3 T4', 0, 3),
(991, '工業管理系', 'IM6407701', '排程理論', '水谷英二', 'M1 M2 M3', 0, 3),
(992, '工業管理系', 'IM6408701', '人機系統應用', '林樹強', 'F2 F3 F4', 0, 3),
(993, '工業管理系', 'IM6613701', '專案管理', '多位教師{王孔政、羅士哲}', 'S6 S7 S8', 0, 3),
(994, '工業管理系', 'IM6809701', '人因工程與設計', '林承哲', 'T6 T7 T8', 0, 3),
(995, '工業管理系', 'IM7005701', '存貨管理系統及其應用', '郭伯勳', 'W2 W3 W4', 0, 3),
(996, '工業管理系', 'IM7103701', '應用機率模型', '水谷英二', 'R1 R2 R3', 0, 3),
(997, '工業管理系', 'IM7301701', '人因工程心理基礎', '紀佳芬', 'W6 W7 W8', 0, 3),
(998, '工業管理系', 'IM7303701', '人因工程生理基礎', '林久翔', 'M2 M3 M4', 0, 3),
(999, '工業管理系', 'IM7402701', '存貨理論', '曹譽鐘', 'M2 M3 M4', 0, 3),
(1000, '工業管理系', 'IM9001701', '全面品質管理', '多位教師{林義貴、葉瑞徽}', 'WA WB WC', 0, 3),
(1001, '工業管理系', 'IM9002701', '全球運籌管理', '羅士哲', 'F6 F7 F8', 0, 3),
(1002, '工業管理系', 'IM9003701', '品質管制方法', '王福琨', 'T6 T7 T8', 0, 3),
(1003, '工業管理系', 'IM9007701', '人性化管理與設計', '紀佳芬', 'RA RB RC', 0, 3),
(1004, '工業管理系', 'IM9009701', '創新與企業流程再造', '多位教師{林義貴、歐陽超}', 'FA FB FC', 0, 3),
(1005, '工業管理系', 'MB2100301', '管理與企業倫理', '李國光', 'R7 R8 R9', 1, 3),
(1006, '工業管理系', 'MB2100302', '管理與企業倫理', '林義貴', 'R7 R8 R9', 1, 3),
(1007, '工業管理系', 'MB2100303', '管理與企業倫理', '羅凱揚', 'R7 R8 R9', 1, 3),
(1008, '工業管理系', 'TC1011701', '職業倫理', '多位教師{陳亞男、游紫華}', 'T2', 0, 1),
(1009, '工業管理系', 'TC2001701', '全民國防教育軍事訓練－全民國防', '胡金妮', 'M8 M9', 0, 0),
(1010, '工業管理系', 'TC2002701', '全民國防教育軍事訓練－防衛動員', '張敏郎', 'T8 T9', 0, 0),
(1011, '工業管理系', 'TC2003701', '全民國防教育軍事訓練－國防政策', '陳世平', 'R8 R9', 0, 0),
(1012, '工業管理系', 'TC2004701', '全民國防教育軍事訓練－國防科技', '謝宏偉', 'W8 W9', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `message`
--

CREATE TABLE `message` (
  `id` int(11) NOT NULL,
  `user_name` varchar(50) NOT NULL,
  `message_subject` varchar(255) NOT NULL,
  `message_content` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- --------------------------------------------------------

--
-- Table structure for table `review`
--

CREATE TABLE `review` (
  `id` int(11) NOT NULL,
  `user_name` varchar(50) NOT NULL,
  `department` varchar(255) NOT NULL,
  `course_name` varchar(255) NOT NULL,
  `course_teacher` varchar(255) NOT NULL,
  `review_subject` varchar(255) NOT NULL,
  `review_content` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- Dumping data for table `review`
--

INSERT INTO `review` (`id`, `user_name`, `department`, `course_name`, `course_teacher`, `review_subject`, `review_content`) VALUES
(1, '21r21', '資訊管理系', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `department` varchar(50) NOT NULL,
  `grade` varchar(10) NOT NULL,
  `email` text NOT NULL,
  `account` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `gender` tinyint(1) NOT NULL,
  `user_bio` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `department`, `grade`, `email`, `account`, `password`, `gender`, `user_bio`) VALUES
(4, '高盛哲', 'frontend_developer', 'four', 'maf@fewkm', 'iamga', '123456', 1, 'hello'),
(5, '1234', 'fwqf', 'fqwf', 'fqwfqw', '123', '456', 1, 'fwqfwq'),
(6, '21r21', 'frontend_developer', 'two', '214@1r32', 'abcd', 'abcd', 0, 'fewfbdf');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `course`
--
ALTER TABLE `course`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `message`
--
ALTER TABLE `message`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `review`
--
ALTER TABLE `review`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `course`
--
ALTER TABLE `course`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1013;
--
-- AUTO_INCREMENT for table `message`
--
ALTER TABLE `message`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `review`
--
ALTER TABLE `review`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
